##  **Project 3 - Part 3 (Core)**

### **Author: P. Slabber**

The project assignment is at the beginning of this week because you already have all of the background to complete project part 3 based on the first two weeks of the course!

Business Problem
For this project, you have been hired to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset. Ultimately, you will use this database to analyze what makes a movie successful, and will provide recommendations to the stakeholder on how to make a successful movie.
Over the course of this project, you will:

**Part 1:** Download several files from IMDBâ€™s movie data set and filter out the subset of moves requested by the stakeholder.

**Part 2:** Use an API to extract box office revenue and profit data to add to your IMDB data and perform exploratory data analysis.

**Part 3:** Construct and export a MySQL database using your data.

**Part 4:** Apply hypothesis testing to explore what makes a movie successful.

**Part 5:** (Optional): Produce a Linear Regression model to predict movie performance.

## **Part 3**

For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database. You will export your database to a .sql file in your repository using MySQL Workbench.

### **Specifications - Database**

- Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project and wants you to create a MySQL database for them.

- Specifically, they want the data from the following files included in your database:

  - Title Basics: 
     - Movie ID (tconst) 
     - Primary Title 
     - Start Year 
     - Runtime (in Minutes) 
     - Genres 

  - Title Ratings 
     - Movie ID (tconst)
     - Average Movie Rating 
     - Number of Votes 

  - The TMDB API Results (multiple files)
     - Movie ID 
     - Revenue 
     - Budget 
     - Certification (MPAA Rating)
 
  
- You should normalize the tables as best you can before adding them to your new database.
   - Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).
   - You only need to keep the imdb_id, revenue, budget, and certification columns.

### **Required Transformation Steps for Title Basics:**

- Normalize Genre:
   - Convert the single string of genres from title basics into 2 new tables.
      - title_genres: with the columns:
         - tconst
         - genre_id
      - genres:
         - genre_id
         - genre_name
    

- Discard unnecessary information:
   - For the title basics table, drop the following columns:
      - "original_title" (we will use the primary title column instead)
      - "isAdult" ("Adult" will show up in the genres so this is redundant information).
      - "titleType" (every row will be a movie).
      - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
   - Do not include the title_akas table in your SQL database
     - You have already filtered out the desired movies using this table, and the remaining data is mostly nulls and not of interest to the stakeholder.

### **MySQL Database Requirements**

 - Use sqlalchemy with Pandas to execute your SQL queries inside your notebook.
 - Create a new database on your MySQL server and call it "movies."
 - Make sure to have the following tables in your "movies" database:
    - title_basics
    - title_ratings
    - title_genres
    - genres
    - tmdb_data
 - Make sure to set a Primary Key for each table that isn't a joiner table (e.g., title_genres is a joiner table).
 - After creating each table, show the first 5 rows of that table using a SQL query.
 - Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

### **Deliverables**

Submit a link to your github repository containing the Jupyter Notebook file.

#### **Load Data**

In [1]:
## Standard Imports
import numpy as np
import pandas as pd

## Importing the OS and JSON Modules
import os,json
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine, MetaData
from sqlalchemy import String, Integer, Float, Text
from sqlalchemy import Column, Integer, String, Float, Text, ForeignKey , ARRAY, BOOLEAN , INTEGER
from sqlalchemy.ext.declarative import declarative_base

In [2]:
basics = pd.read_csv('C:/Users/tspiet/Documents/GitHub/Distributions/data/title_basics.csv.gz')
basics.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama
2,tt0102362,movie,Istota,Istota,0,2000,NaN,80,"Drama,Romance"

In [3]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8643 entries, 0 to 8642
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          8643 non-null   object
 1   titleType       8643 non-null   object
 2   primaryTitle    8643 non-null   object
 3   originalTitle   8643 non-null   object
 4   isAdult         8643 non-null   int64
 5   startYear       8643 non-null   int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  8643 non-null   int64
 8   genres          8643 non-null   object
dtypes: float64(1), int64(3), object(5)
memory usage: 607.8+ KB

In [4]:
ratings = pd.read_csv('C:/Users/tspiet/Documents/GitHub/Distributions/data/title.ratings.tsv.gz')
ratings.head(3)

  tconst\taverageRating\tnumVotes
0            tt0000001\t5.7\t2002
1             tt0000002\t5.8\t269
2            tt0000003\t6.5\t1893

In [5]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1359838 entries, 0 to 1359837
Data columns (total 1 columns):
 #   Column                         Non-Null Count    Dtype
---  ------                         --------------    -----
 0   tconst	averageRating	numVotes  1359838 non-null  object
dtypes: object(1)
memory usage: 10.4+ MB

In [51]:
results_imdb = pd.read_csv('C:/Users/tspiet/Documents/GitHub/Distributions/data/tmdb_results_combined.csv.gz')
results_imdb.head(3)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.45,10.0,NaN

In [7]:
results_imdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4586 entries, 0 to 4585
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                4586 non-null   object
 1   adult                  4584 non-null   float64
 2   backdrop_path          2164 non-null   object
 3   belongs_to_collection  265 non-null    object
 4   budget                 4584 non-null   float64
 5   genres                 4584 non-null   object
 6   homepage               228 non-null    object
 7   id                     4584 non-null   float64
 8   original_language      4584 non-null   object
 9   original_title         4584 non-null   object
 10  overview               4245 non-null   object
 11  popularity             4584 non-null   float64
 12  poster_path            3994 non-null   object
 13  production_companies   4584 non-null   object
 14  production_countries   4584 non-null   object
 15  release_date           4542 non-null   object
 16  revenue                4584 non-null   float64
 17  runtime                4584 non-null   float64
 18  spoken_languages       4584 non-null   object
 19  status                 4584 non-null   object
 20  tagline                1327 non-null   object
 21  title                  4584 non-null   object
 22  video                  4584 non-null   float64
 23  vote_average           4584 non-null   float64
 24  vote_count             4584 non-null   float64
 25  certification          839 non-null    object
dtypes: float64(9), object(17)
memory usage: 931.7+ KB

In [8]:
# Drop unnecessary columns
basics.drop(['originalTitle', 'isAdult', 'titleType'], axis=1, inplace=True)

#### **Normalize the Data:**

#### **Getting a List of Unique Genres**

In [9]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0096056,Crime and Punishment,2002,NaN,126,Drama,[Drama]
2,tt0102362,Istota,2000,NaN,80,"Drama,Romance","[Drama, Romance]"
3,tt0112912,Dune 7,2002,NaN,97,Adventure,[Adventure]
4,tt0113026,The Fantasticks,2000,NaN,86,"Musical,Romance","[Musical, Romance]"
...,...,...,...,...,...,...,...
8638,tt9815124,Mami Jarum,2002,NaN,95,"Comedy,Family,Romance","[Comedy, Family, Romance]"
8639,tt9815482,The Witch,2002,NaN,65,Horror,[Horror]
8640,tt9837894,Tizca. Gli Uccelli Dipinti del Caucaso,2001,NaN,91,Drama,[Drama]
8641,tt9853452,Veszett idÃ¶k,2001,NaN,62,Fantasy,[Fantasy]
8642,tt9874290,Star Trek: Incident at Beta 9,2002,NaN,57,Sci-Fi,[Sci-Fi]

In [10]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0096056,Crime and Punishment,2002,NaN,126,Drama,Drama
2,tt0102362,Istota,2000,NaN,80,"Drama,Romance",Drama
...,...,...,...,...,...,...,...
8638,tt9815124,Mami Jarum,2002,NaN,95,"Comedy,Family,Romance",Romance
8639,tt9815482,The Witch,2002,NaN,65,Horror,Horror
8640,tt9837894,Tizca. Gli Uccelli Dipinti del Caucaso,2001,NaN,91,Drama,Drama
8641,tt9853452,Veszett idÃ¶k,2001,NaN,62,Fantasy,Fantasy
8642,tt9874290,Star Trek: Incident at Beta 9,2002,NaN,57,Sci-Fi,Sci-Fi

In [12]:
## Get the string column converted to a list of strings in each row
genres_split = basics['genres'].str.split(",")

# Explode the series using .explode() and take the .unique() entries only.
unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Adventure', 'Musical',
       'Action', 'Crime', 'Thriller', 'Music', 'Horror', 'Mystery',
       'Animation', 'Family', 'History', 'War', 'Sci-Fi', 'Biography',
       'Sport', 'Western', 'Adult', 'Reality-TV', 'News'], dtype=object)

In [13]:
basics.drop(['genres'], axis=1, inplace=True)

In [14]:
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"[Comedy, Fantasy, Romance]"
1,tt0096056,Crime and Punishment,2002,NaN,126,[Drama]
2,tt0102362,Istota,2000,NaN,80,"[Drama, Romance]"
3,tt0112912,Dune 7,2002,NaN,97,[Adventure]
4,tt0113026,The Fantasticks,2000,NaN,86,"[Musical, Romance]"

In [15]:
# Sort the list of Unique genres in alphabetical order
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Thriller',
 'War',
 'Western']

#### **Create a new title_genres table**

In [16]:
## Save just tconst and genres_split as new df
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres

         tconst genres_split
0     tt0035423       Comedy
0     tt0035423      Fantasy
0     tt0035423      Romance
1     tt0096056        Drama
2     tt0102362        Drama
...         ...          ...
8638  tt9815124      Romance
8639  tt9815482       Horror
8640  tt9837894        Drama
8641  tt9853452      Fantasy
8642  tt9874290       Sci-Fi

[15772 rows x 2 columns]

#### **Create a genre mapper dictionary to replace string genres with integers**

In [17]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'History': 10,
 'Horror': 11,
 'Music': 12,
 'Musical': 13,
 'Mystery': 14,
 'News': 15,
 'Reality-TV': 16,
 'Romance': 17,
 'Sci-Fi': 18,
 'Sport': 19,
 'Thriller': 20,
 'War': 21,
 'Western': 22}

In [18]:
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'History': 10,
 'Horror': 11,
 'Music': 12,
 'Musical': 13,
 'Mystery': 14,
 'News': 15,
 'Reality-TV': 16,
 'Romance': 17,
 'Sci-Fi': 18,
 'Sport': 19,
 'Thriller': 20,
 'War': 21,
 'Western': 22}

#### **Replace the string genres in title_genres with the new integer ids.**

In [19]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.drop('genres_split', axis=1, inplace=True)
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        17
1  tt0096056         7
2  tt0102362         7

#### **Convert the genre map dictionary into a dataframe.**

In [20]:
# Manually make dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'Genre_Name': list(genre_id_map.keys()),
                             'Genre_ID': list(genre_id_map.values())})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

#### **Saving the MySQL tables with tconst as the primary key.**

In [21]:
connection_str = "mysql+pymysql://root:root@127.0.0.1/movies"
engine = create_engine(connection_str)
create_database(connection_str)

In [22]:
from sqlalchemy import create_engine, MetaData

# Define your engine and models
engine = create_engine('mysql+pymysql://root:root@127.0.0.1/movies')
metadata = MetaData()

# Create all tables in the database
metadata.create_all(engine)

#### **title_genres**

In [23]:
# Calculate max string lengths for object columns
tconst_len = title_genres['tconst'].fillna('').map(len).max()

In [24]:
title_genres_schema = {
    "tconst": String(tconst_len + 1),
    "genre_id": Integer()
}

In [25]:
# Save to sql with dtype, index=False, and set the primary key
title_genres.to_sql('title_genres', engine, dtype=title_genres_schema, if_exists='replace', index=False)

# Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`, `genre_id`);')

In [26]:
q = """
SELECT *
FROM title_genres
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        17
3  tt0096056         7
4  tt0102362         7

#### **Genres**

In [27]:
title_genres_schema = {
    "Genre_Name": String(tconst_len + 1),
    "Genre_ID": Integer()
}

In [28]:
# Save to sql with dtype, index=False, and set the primary key
genre_lookup.to_sql('genres', engine, dtype=title_genres_schema, if_exists='replace', index=False)

23

In [29]:
# Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_Name`, `Genre_ID`);')

In [30]:
q = """
SELECT *
FROM genres
LIMIT 5;
"""

pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

#### **title_basics**

In [31]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8643 entries, 0 to 8642
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          8643 non-null   object
 1   primaryTitle    8643 non-null   object
 2   startYear       8643 non-null   int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  8643 non-null   int64
 5   genres_split    8643 non-null   object
dtypes: float64(1), int64(2), object(3)
memory usage: 405.3+ KB

In [32]:
title_basics_schema = {
    "tconst": String(tconst_len + 1),
    "titleType": String(255),
    "primaryTitle": String(255),
    "startYear": Integer(),
    "endYear": Integer(),
    "runtimeMinutes": Integer(),
    "genres": String(255),
}

In [33]:
basics['genres_split'] = basics['genres_split'].apply(lambda x: ', '.join(x))

In [34]:
# Create the table without the primary key
basics.to_sql('title_basics', engine, dtype=title_basics_schema, if_exists='replace', index=False)

8643

In [35]:
# Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [36]:
q = """
SELECT *
FROM title_basics
LIMIT 5;
"""

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres_split
0,tt0035423,Kate & Leopold,2001,None,118,"Comedy, Fantasy, Romance"
1,tt0096056,Crime and Punishment,2002,None,126,Drama
2,tt0102362,Istota,2000,None,80,"Drama, Romance"
3,tt0112912,Dune 7,2002,None,97,Adventure
4,tt0113026,The Fantasticks,2000,None,86,"Musical, Romance"

#### **Clean Rating**

In [37]:
# Split the 'tconst' column into three separate columns
ratings[['tconst', 'averageRating', 'numVotes']] = ratings['tconst\taverageRating\tnumVotes'].str.split('\t', expand=True)
# Drop the original combined column
ratings = ratings.drop('tconst\taverageRating\tnumVotes', axis=1)
ratings.head()

      tconst averageRating numVotes
0  tt0000001           5.7     2002
1  tt0000002           5.8      269
2  tt0000003           6.5     1893
3  tt0000004           5.5      178
4  tt0000005           6.2     2678

#### **title_ratings**

In [40]:
title_ratings_schema = {
    "tconst": String(255),  # Use String instead of VARCHAR
    'averageRating': String(255),
    'numVotes': Integer,  # Assuming numVotes is an integer
}

In [41]:
# Recreate the table with the new schema
ratings.to_sql('title_ratings', engine, dtype=title_ratings_schema, if_exists='replace', index=False)

1359838

In [42]:
# Add the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [43]:
q = """
SELECT *
FROM title_ratings
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst averageRating  numVotes
0  tt0000001           5.7      2002
1  tt0000002           5.8       269
2  tt0000003           6.5      1893
3  tt0000004           5.5       178
4  tt0000005           6.2      2678

#### **tmdb_data**

In [52]:
results_imdb.drop(['adult', 'belongs_to_collection', 'backdrop_path', 'genres', 'homepage', 'id', 'original_language', 'original_title', 'overview', 'popularity', 'poster_path', 'production_companies', 'production_countries', 'release_date', 'runtime', 'spoken_languages', 'status', 'tagline', 'title', 'video', 'vote_average', 'vote_count' ], axis=1, inplace=True)
results_imdb

        imdb_id      budget  revenue certification
0             0         NaN      NaN           NaN
1     tt0113026  10000000.0      0.0           NaN
2     tt0113092         0.0      0.0           NaN
3     tt0116391         0.0      0.0           NaN
4     tt0116748         0.0      0.0           NaN
...         ...         ...      ...           ...
4581  tt8942962         0.0      0.0           NaN
4582  tt9071078    127389.0      0.0           NaN
4583  tt9099724         0.0      0.0           NaN
4584  tt9212730         0.0      0.0           NaN
4585  tt9798698         0.0      0.0           NaN

[4586 rows x 4 columns]

In [54]:
title_tmdb_data_schema = {
    "tconst" : Column(String(255), primary_key=True),
    "imdb_id" : Column(String(255)),
    "budget" : Column(Integer),
    "revenue" : Column(Integer),
    "certification" : Column(String(255))
}

In [55]:
# Recreate the table with the new schema
results_imdb.to_sql('tmdb_data', engine, dtype=title_ratings_schema, if_exists='replace', index=False)

4586

In [56]:
q = """
SELECT *
FROM tmdb_data
LIMIT 5;
"""

pd.read_sql(q, engine)

     imdb_id      budget  revenue certification
0          0         NaN      NaN          None
1  tt0113026  10000000.0      0.0          None
2  tt0113092         0.0      0.0          None
3  tt0116391         0.0      0.0          None
4  tt0116748         0.0      0.0          None

#### **Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.**

In [58]:
show_tables_query = """
SHOW TABLES;
"""

# Execute the query and display the result
tables_result = pd.read_sql(show_tables_query, engine)
print(tables_result)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data